
# ----------------- დავალება4 -----------------
# დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და ბეჭდავს 1-დან "n"-მდე რიცხვების ჯამს.

# n = eval(input('შეიყვანეთ რიცხვი \n'))
# for i in range(1,n):
#     print(i)



# დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ იყენებს "while" ციკლს რომ რევესრულად დაბეჭდოს რიცხვები 0-მდე. მაგალითად თუ შეიყვანს 4, დაიბეჭდოს 4, 3, 2, 1

# n = eval(input('შეიყვანეთ რიცხვი \n'))
# for i in range(n,0,-1):
#     print(i)



# დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს გამოიცნოს წინასწარ განსაზღვრული რიცხვი. როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, დაასრულებს პროგრამა მუშაობას.

# n=40
# userInput = ''
# while userInput != n:
#     userInput = eval(input('შეიყვანეთ რიცხვი \n'))
# print("თქვენ გამოიცანით")



# დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum = 0, შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ შეიყვანს 'sum' ტექსტს, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.

# total_sum = 0
# userInput = ''
# while True:
#     userInput = input('შეიყვანეთ რიცხვი \n')
#     if userInput == 'sum':
#         break
#     if eval(userInput) > 0 :
#         total_sum = total_sum + eval(userInput)
# print("ჯამი = ",total_sum)



# /----------------- დავალება4 -----------------