
# ----------------- დავალება 5 -----------------
#  1.დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს და აბრუნებს სტრიქონის UTF-8 დაშიფრულ ვერსიას.

# a = input('შეიყვანეთ სტრიქონი')
# print(a.encode('utf-8'))

#  2.დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს. ჩამოაშორეთ ზედმეტი ინტერვალები. ყველა სიმბოლო გადაიყვანეთ პატარა ასოებში და დაუმატეთ ქვესტრიქონი 'Python'. თუ შეყვანილ სტრიქონში არსებობს სიტყვა "python", ჩაანაცვლეთ "Python"-ით.
     # მინიშნება: ზედმეტი ინტერვალების ჩამოსაშორებელი მეთოდია .strip().
     # მაგ.:  "  Python is funny     ".strip()   ====>  "Python is funny"

# a = input('შეიყვანეთ სტრიქონი')
# if 'python' in a:
#     print(a.strip().lower().replace('python','Python'))
# else:
#     print(a.strip().lower()+' Python')

#  3.დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს და აბრუნებს ახალ სტრიქონს, რომელიც შედგება შეყვანილი სტრიქონის პირველი ნახევრისაგან.
    
# a = input('შეიყვანეთ სტრიქონი')
# print(a[0:(len(a)//2)])

#  4.დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს. string მოდულის გამოყენებით დაწერეთ შემოწმება. სტრიქონი ვალიდურია მაშინ, როდესაც ის შეიცავს ერთ ციფრს და არ არის დამატებითი სიმბოლოები ('!', '~', '#', '$' და ა.შ.)

# a = input('შეიყვანეთ სტრიქონი')
# digitQ = 0
# valid = False
# if a.isalnum():
#     for i in a:
#         if i.isdigit():
#             digitQ += 1
#     print(digitQ)
#     if digitQ == 1:
#         valid = True
# print('string valid is '+ str(valid) )


#  5.დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს, სტრიქონი გადაყავს ბაიტებში, ბეჭდავს მნიშვნელობას და შემდეგ კი გადაყავს ბაიტებიდან სტრიქონში და ბეჭდავს სტრიქონს.

# a = input('შეიყვანეთ სტრიქონი')
# a = (a.encode('utf8'))
# print(a)
# a = a.decode('utf8')
# print(a)


# /----------------- დავალება 5 -----------------