

# ----------------- დავალება 8 -----------------
# 1. შექმენით გლობალური ცვლადი int_list = [10,20,30,40] და დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს რიცხვს პარამეტრად და გლობალურ int_list სიაში ჩაამატებს პარამეტრად მიღებულ რიცხვს.
    
# int_list = [10,20,30,40]
# def func(a):
#     global int_list
#     int_list.append(a)
# func(90)
# print(int_list)

# 2. დაწერეთ პითნის ფუნქცია რომელიც პარამეტრად იღებს რიცხვების სიას (ლისტს) და აბრუნებს რიცხვების ჯამს. პარამეტრად უნდა მიიღოს შემდეგი სია [100, 20, 30, 50, 5323, 3321, 22, 56, 700, 90, 10].

# def func(num):
#     sum = 0
#     for i in num:
#         sum += i
#     return(sum)
# print(func([100, 20, 30, 50, 5323, 3321, 22, 56, 700, 90, 10]))

# 3. შექმენით გლობალური ცვლადი gl_str = "Global" და დაწერეთ პითონის ფუნქცია რომელიც ქმნის ლოკალურ ცვლადს იგივე სახელით რაც გლობალურ ცვლადს აქვს (gl_str) და აბრუნებს ლოკალური ცვლადის მნიშვნელობას

# gl_str = "Global"
# def func(a):
#     gl_str =''
#     gl_str = a
#     return(gl_str)
# print('gl_str = ',gl_str)
# print(func(81650))

# 4. რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს ერთ პარამეტრს number და დააბრუნებს ციფრების ჯამს (მაგალითად თუ ფუნქციამ მიიღო რიცხვი 12345, უნდა დააბრუნოს 15. რადგან 1+2+3+4+5 უდრის 15-ს).

# def func(number):
#     if len(str(number)) == 1:
#         return number
#     return (int(str(number)[0]) + func(int(str(number)[1:])))
# print(func(12345))


# 5. რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად სტრიქონს და დააბრუნებს მის შებრუნებულ (revers) სტრიქონს (მაგალითად input: Hello Output: olleH)

# def func(st):
#         if len(st) == 1:
#                 return st[0]
#         return(st[-1]+func(st[0:-1]))
# print(func('Hello my Friend'))

# /----------------- დავალება 8 -----------------